In [4]:
import pandas as pd

people = pd.DataFrame(
    [
        ["Joey",     "blue",  42, "M"],
        ["Weiwei",   "blue",  50, "F"],
        ["Joey",     "green",  8, "M"],
        ["Karina",   "green",  7, "F"],
        ["Fernando", "pink",  -9, "M"],
        ["Nhi",      "blue",   3, "F"],
        ["Sam",      "pink",  -42, "M"]
    ],
    columns = ["Name", "Color", "Number", "Sex"]
)
people
print (people)

       Name  Color  Number Sex
0      Joey   blue      42   M
1    Weiwei   blue      50   F
2      Joey  green       8   M
3    Karina  green       7   F
4  Fernando   pink      -9   M
5       Nhi   blue       3   F
6       Sam   pink     -42   M

In [5]:
grps = people.groupby("Color")
grps

In [6]:
grps.size()

Color
blue     3
green    2
pink     2
dtype: int64

In [7]:
grps.apply(lambda df: display(df))

     Name Color  Number Sex
0    Joey  blue      42   M
1  Weiwei  blue      50   F
5     Nhi  blue       3   F

     Name Color  Number Sex
0    Joey  blue      42   M
1  Weiwei  blue      50   F
5     Nhi  blue       3   F

     Name  Color  Number Sex
2    Joey  green       8   M
3  Karina  green       7   F

       Name Color  Number Sex
4  Fernando  pink      -9   M
6       Sam  pink     -42   M

Empty DataFrame
Columns: []
Index: []

In [9]:
people.loc[grps.indices["blue"], :]

     Name Color  Number Sex
0    Joey  blue      42   M
1  Weiwei  blue      50   F
5     Nhi  blue       3   F

In [10]:
people.groupby("Color")["Number"].median()

Color
blue     42.0
green     7.5
pink    -25.5
Name: Number, dtype: float64

In [11]:
people.groupby("Color")["Number"].mean()

Color
blue     31.666667
green     7.500000
pink    -25.500000
Name: Number, dtype: float64

In [12]:
people.groupby("Color")["Number"].count()

Color
blue     3
green    2
pink     2
Name: Number, dtype: int64

In [14]:
people.groupby(["Color", "Sex"])["Number"].count()

Color  Sex
blue   F      2
       M      1
green  F      1
       M      1
pink   M      2
Name: Number, dtype: int64

In [15]:
people.groupby(["Color", "Sex"])[['Name', 'Number']].count()

           Name  Number
Color Sex
blue  F       2       2
      M       1       1
green F       1       1
      M       1       1
pink  M       2       2

In [16]:
import numpy as np
def avg_str_len(series):
    return series.str.len().mean()

res = (
    people
        .groupby(["Color", "Sex"])
        .aggregate({"Name": avg_str_len, "Number": np.mean})
)
res

           Name  Number
Color Sex
blue  F     4.5    26.5
      M     4.0    42.0
green F     6.0     7.0
      M     4.0     8.0
pink  M     5.5   -25.5

In [17]:
res.loc[['blue', 'F'], :]

           Name  Number
Color Sex
blue  F     4.5    26.5
      M     4.0    42.0

In [18]:
res.loc[['green'], :]

           Name  Number
Color Sex
green F     6.0     7.0
      M     4.0     8.0

In [25]:
(
    people
        .groupby(["Color", "Sex"], as_index=False)
        .aggregate({"Name": "first", "Number": np.mean})
)

   Color Sex      Name  Number
0   blue   F    Weiwei    26.5
1   blue   M      Joey    42.0
2  green   F    Karina     7.0
3  green   M      Joey     8.0
4   pink   M  Fernando   -25.5

In [24]:
people

       Name  Color  Number Sex
0      Joey   blue      42   M
1    Weiwei   blue      50   F
2      Joey  green       8   M
3    Karina  green       7   F
4  Fernando   pink      -9   M
5       Nhi   blue       3   F
6       Sam   pink     -42   M